reports/M-001/raw/a-ws-vs-poll/m1a-poll1000-N1000-r1.k6.txt


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.02%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.02% 289499 out of 295338
    poll_staleness_ms.......................................................: min=14ms     med=544ms   p(95)=990ms    p(99)=1.04s    max=1.29s

    HTTP
    http_req_duration.......................................................: min=858µs    med=83.98ms p(95)=350.49ms p(99)=469.81ms max=1.16s
      { expected_response:true }............................................: min=1.31ms   med=84.16ms p(95)=350.57ms p(99)=469.7ms  max=1.16s
    http_req_failed.........................................................: 1.97%  5839 out of 295338
    http_reqs...............................................................: 295338 4908.000867/s

    EXECUTION
    dropped_iterations......................................................: 4661   77.457666/s
    iteration_duration......................................................: min=884.95µs med=84.04ms p(95)=350.59ms p(99)=469.92ms max=1.16s
    iterations..............................................................: 295338 4908.000867/s
    vus.....................................................................: 982    min=10               max=1720
    vus_max.................................................................: 1742   min=574              max=1742

    NETWORK
    data_received...........................................................: 164 MB 2.7 MB/s
    data_sent...............................................................: 31 MB  518 kB/s



time="2026-09-17T00:46:36+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"