reports/M-001/raw/a-ws-vs-poll/m1a-poll1000-N1000-r2.k6.txt


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.02%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.02% 292965 out of 298857
    poll_staleness_ms.......................................................: min=15ms     med=544ms  p(95)=990ms   p(99)=1.04s    max=1.28s   

    HTTP
    http_req_duration.......................................................: min=840µs    med=3.25ms p(95)=77.64ms p(99)=180.75ms max=654.39ms
      { expected_response:true }............................................: min=1.37ms   med=3.27ms p(95)=77.64ms p(99)=180.86ms max=654.39ms
    http_req_failed.........................................................: 1.97%  5892 out of 298857
    http_reqs...............................................................: 298857 4980.815103/s

    EXECUTION
    dropped_iterations......................................................: 1144   19.06615/s
    iteration_duration......................................................: min=883.79µs med=3.31ms p(95)=77.72ms p(99)=180.81ms max=654.45ms
    iterations..............................................................: 298857 4980.815103/s
    vus.....................................................................: 12     min=9                max=433
    vus_max.................................................................: 670    min=250              max=670

    NETWORK
    data_received...........................................................: 166 MB 2.8 MB/s
    data_sent...............................................................: 32 MB  525 kB/s



time="2026-09-17T00:47:51+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"