reports/M-001/raw/a-ws-vs-poll/m1a-poll1000-N1000-r3.k6.txt


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.02%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.02% 292262 out of 298145
    poll_staleness_ms.......................................................: min=14ms     med=537ms  p(95)=990ms    p(99)=1.03s    max=1.3s    

    HTTP
    http_req_duration.......................................................: min=804µs    med=4.08ms p(95)=135.08ms p(99)=244.24ms max=772.22ms
      { expected_response:true }............................................: min=1.34ms   med=4.1ms  p(95)=135.15ms p(99)=244.36ms max=772.22ms
    http_req_failed.........................................................: 1.97%  5883 out of 298145
    http_reqs...............................................................: 298145 4968.676068/s

    EXECUTION
    dropped_iterations......................................................: 1855   30.914133/s
    iteration_duration......................................................: min=838.75µs med=4.14ms p(95)=135.16ms p(99)=244.35ms max=772.27ms
    iterations..............................................................: 298145 4968.676068/s
    vus.....................................................................: 19     min=9                max=850
    vus_max.................................................................: 890    min=250              max=890

    NETWORK
    data_received...........................................................: 166 MB 2.8 MB/s
    data_sent...............................................................: 31 MB  524 kB/s



time="2026-09-17T00:49:03+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"