reports/M-001/raw/a-ws-vs-poll/m1a-poll1000-N10000-r2.k6.txt
time="2026-09-17T01:19:09+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.01%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.01%  316405 out of 322804
    poll_staleness_ms.......................................................: min=13ms   med=548ms    p(95)=991ms    p(99)=1.03s    max=1.26s

    HTTP
    http_req_duration.......................................................: min=2.97ms med=538.58ms p(95)=715.09ms p(99)=820.48ms max=1.35s
      { expected_response:true }............................................: min=2.97ms med=538.64ms p(95)=715.24ms p(99)=820.56ms max=1.35s
    http_req_failed.........................................................: 1.98%   6399 out of 322804
    http_reqs...............................................................: 322804  5320.695421/s

    EXECUTION
    dropped_iterations......................................................: 2677212 44127.797762/s
    iteration_duration......................................................: min=3.01ms med=538.65ms p(95)=715.13ms p(99)=820.52ms max=1.35s
    iterations..............................................................: 322804  5320.695421/s
    vus.....................................................................: 3000    min=2475             max=3000
    vus_max.................................................................: 3000    min=2477             max=3000

    NETWORK
    data_received...........................................................: 179 MB  3.0 MB/s
    data_sent...............................................................: 34 MB   561 kB/s



time="2026-09-17T01:20:08+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"