reports/M-001/raw/a-ws-vs-poll/m1a-poll1000-N10000-r3.k6.txt
time="2026-09-17T01:20:33+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.01%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.01%  317331 out of 323747
    poll_staleness_ms.......................................................: min=14ms   med=547ms    p(95)=991ms    p(99)=1.03s    max=1.29s

    HTTP
    http_req_duration.......................................................: min=3.08ms med=534.53ms p(95)=728.73ms p(99)=856.72ms max=1.46s
      { expected_response:true }............................................: min=3.08ms med=534.57ms p(95)=728.68ms p(99)=856.34ms max=1.46s
    http_req_failed.........................................................: 1.98%   6416 out of 323747
    http_reqs...............................................................: 323747  5342.402934/s

    EXECUTION
    dropped_iterations......................................................: 2676253 44162.947852/s
    iteration_duration......................................................: min=3.1ms  med=534.59ms p(95)=728.8ms  p(99)=856.78ms max=1.46s
    iterations..............................................................: 323747  5342.402934/s
    vus.....................................................................: 3000    min=2552             max=3000
    vus_max.................................................................: 3000    min=2553             max=3000

    NETWORK
    data_received...........................................................: 180 MB  3.0 MB/s
    data_sent...............................................................: 34 MB   564 kB/s



time="2026-09-17T01:21:33+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"