reports/M-001/raw/a-ws-vs-poll/m1a-poll1000-N5000-r1.k6.txt
time="2026-09-17T01:00:05+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.02%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.02%  324539 out of 331092
    poll_staleness_ms.......................................................: min=15ms   med=543ms    p(95)=990ms    p(99)=1.03s    max=1.27s

    HTTP
    http_req_duration.......................................................: min=2.76ms med=527.52ms p(95)=693.99ms p(99)=797.31ms max=1.34s
      { expected_response:true }............................................: min=2.76ms med=527.56ms p(95)=693.99ms p(99)=797.33ms max=1.34s
    http_req_failed.........................................................: 1.97%   6553 out of 331092
    http_reqs...............................................................: 331092  5473.038765/s

    EXECUTION
    dropped_iterations......................................................: 1168910 19322.392997/s
    iteration_duration......................................................: min=2.79ms med=527.59ms p(95)=694.05ms p(99)=797.37ms max=1.34s
    iterations..............................................................: 331092  5473.038765/s
    vus.....................................................................: 2998    min=2467             max=3000
    vus_max.................................................................: 3000    min=2468             max=3000

    NETWORK
    data_received...........................................................: 184 MB  3.0 MB/s
    data_sent...............................................................: 35 MB   577 kB/s



time="2026-09-17T01:01:04+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"