reports/M-001/raw/a-ws-vs-poll/m1a-poll1000-N5000-r2.k6.txt
time="2026-09-17T01:01:30+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.02%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.02%  310321 out of 316587
    poll_staleness_ms.......................................................: min=14ms   med=554ms    p(95)=991ms    p(99)=1.04s    max=1.3s 

    HTTP
    http_req_duration.......................................................: min=3.04ms med=544.87ms p(95)=744.62ms p(99)=929.87ms max=1.68s
      { expected_response:true }............................................: min=3.04ms med=544.89ms p(95)=744.69ms p(99)=930.4ms  max=1.66s
    http_req_failed.........................................................: 1.97%   6266 out of 316587
    http_reqs...............................................................: 316587  5230.881265/s

    EXECUTION
    dropped_iterations......................................................: 1183415 19553.245561/s
    iteration_duration......................................................: min=3.09ms med=544.93ms p(95)=744.66ms p(99)=929.9ms  max=1.68s
    iterations..............................................................: 316587  5230.881265/s
    vus.....................................................................: 3000    min=2077             max=3000
    vus_max.................................................................: 3000    min=2082             max=3000

    NETWORK
    data_received...........................................................: 176 MB  2.9 MB/s
    data_sent...............................................................: 33 MB   552 kB/s



time="2026-09-17T01:02:29+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"