reports/M-001/raw/a-ws-vs-poll/m1a-poll1000-N5000-r3.k6.txt
time="2026-09-17T01:02:55+09:00" level=warning msg="Insufficient VUs, reached 3000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=poll


  █ THRESHOLDS 

    poll_ok
    ✗ 'rate>0.99' rate=98.02%


  █ TOTAL RESULTS 

    CUSTOM
    poll_ok.................................................................: 98.02%  324706 out of 331264
    poll_staleness_ms.......................................................: min=13ms   med=554ms    p(95)=990ms    p(99)=1.03s    max=1.35s

    HTTP
    http_req_duration.......................................................: min=1.71ms med=515.97ms p(95)=732.02ms p(99)=854.15ms max=1.4s 
      { expected_response:true }............................................: min=2.87ms med=516.02ms p(95)=732.19ms p(99)=854.41ms max=1.4s 
    http_req_failed.........................................................: 1.97%   6558 out of 331264
    http_reqs...............................................................: 331264  5477.668197/s

    EXECUTION
    dropped_iterations......................................................: 1168741 19325.901415/s
    iteration_duration......................................................: min=1.74ms med=516.03ms p(95)=732.08ms p(99)=854.21ms max=1.4s 
    iterations..............................................................: 331264  5477.668197/s
    vus.....................................................................: 3000    min=2319             max=3000
    vus_max.................................................................: 3000    min=2320             max=3000

    NETWORK
    data_received...........................................................: 184 MB  3.0 MB/s
    data_sent...............................................................: 35 MB   578 kB/s



time="2026-09-17T01:03:55+09:00" level=error msg="thresholds on metrics 'poll_ok' have been crossed"